# Данные для тестирования геокодирования
forward_geocoding_data = [
    ("Красная площадь, Москва", "55.753676", "37.621115"),
    ("Невский проспект, Санкт-Петербург", "59.934", "30.335"),
    ("Спасская башня, Москва", "55.753891", "37.62214"),
    ("Большой театр, Москва", "55.76061", "37.618499"),
    ("Петропавловская крепость, Санкт-Петербург", "59.95029", "30.316273"),
    ("Эрмитаж, Санкт-Петербург", "59.71351165", "30.40338793575743"),
    ("Адмиралтейство, Санкт-Петербург", "59.9379882", "30.315987"),
    ("Кронштадт, Санкт-Петербург", "59.990845", "29.76626"),
    ("Красная площадь, Самара", "52.9118989", "50.949962"),
    ("Собор Василия Блаженного, Москва", "55.752523", "37.623087"),
]

reverse_geocoding_data = [
    ("55", "37", "Россия"),
    ("51", "-0.1", "United Kingdom"),
    ("40.0", "-74", "United States"),
    ("48", "2", "France"),
    ("35", "139", "日本"),
    ("-33", "151", "Australia"),
    ("52", "13", "Deutschland"),
    ("37", "-122", "Santa Cruz"),
    ("-22", "-43", "Brasil"),
    ("40", "-3.0", "España"),
]
